import { FAQ } from '@/types'

const faqList: FAQ[] = [
	{
		question: 'Как создать команду?',
		answer:
			'Для создания команды необходимо зарегистрироваться на сайте и перейти в раздел "Команды". Нажмите на кнопку "Создать команду" и заполните все поля. После создания команды вы можете приглашать в нее участников.'
	},
	{
		question: 'Как пригласить участника в команду?',
		answer:
			'Для приглашения участника в команду необходимо перейти в раздел "Команды" и нажать на кнопку "Пригласить участника". Введите email участника и нажмите на кнопку "Пригласить". После этого участник получит письмо с приглашением в команду.'
	},
	{
		question: 'Как принять приглашение в команду?',
		answer:
			'Для принятия приглашения в команду необходимо перейти в раздел "Команды" и нажать на кнопку "Принять приглашение". После этого вы станете участником команды.'
	},
	{
		question: 'Как отказаться от приглашения в команду?',
		answer:
			'Для отказа от приглашения в команду необходимо перейти в раздел "Команды" и нажать на кнопку "Отказаться от приглашения". После этого вы не станете участником команды.'
	},
	{
		question: 'Как покинуть команду?',
		answer:
			'Для покидания команды необходимо перейти в раздел "Команды" и нажать на кнопку "Покинуть команду". После этого вы не будете участником команды.'
	},
	{
		question: 'Как исключить участника из команды?',
		answer:
			'Для исключения участника из команды необходимо перейти в раздел "Команды" и нажать на кнопку "Исключить участника". После этого участник не будет участником команды.'
	}
]

export default faqList
